ab-tests/pokijan.jpg/ab_multiprocessing_secure_c100.txt
C:\xampp\apache\bin>abs -n 1000 -c 100 -s 86400 https://192.168.2.19:20001/pokijan.jpg
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.2.19 (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
SSL handshake failed (5).
SSL handshake failed (5).
SSL handshake failed (5).
[...]
Completed 600 requests
SSL handshake failed (5).
SSL handshake failed (5).
SSL handshake failed (5).
[...]
Completed 700 requests
SSL handshake failed (5).
SSL handshake failed (5).
SSL handshake failed (5).
[...]
Completed 800 requests
SSL handshake failed (5).
SSL handshake failed (5).
SSL handshake failed (5).
[...]
Completed 900 requests
SSL handshake failed (5).
SSL handshake failed (5).
SSL handshake failed (5).
[...]
Completed 1000 requests
SSL handshake failed (5).
SSL handshake failed (5).
SSL handshake failed (5).
Finished 1000 requests


Server Software:        myserver/1.0
Server Hostname:        192.168.2.19
Server Port:            20001
SSL/TLS Protocol:       TLSv1.2,ECDHE-RSA-AES256-GCM-SHA384,2048,256
Server Temp Key:        X25519 253 bits

Document Path:          /pokijan.jpg
Document Length:        15706 bytes

Concurrency Level:      100
Time taken for tests:   397.967 seconds
Complete requests:      1000
Failed requests:        221
   (Connect: 0, Receive: 0, Length: 221, Exceptions: 0)
Total transferred:      12391572 bytes
HTML transferred:       12282092 bytes
Requests per second:    2.51 [#/sec] (mean)
Time per request:       39796.683 [ms] (mean)
Time per request:       397.967 [ms] (mean, across all concurrent requests)
Transfer rate:          30.41 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0 4671 12715.1    352  115378
Processing:     4 30675 58525.5    431  249168
Waiting:        0  370 540.3    113    3648
Total:         21 35346 57521.5   2877  249168

Percentage of the requests served within a certain time (ms)
  50%   2877
  66%   8423
  75%  37045
  80%  130584
  90%  132910
  95%  133144
  98%  133803
  99%  230386
 100%  249168 (longest request)