ab-tests/pokijan.jpg/ab_multiprocessing_secure_c150.txt
C:\xampp\apache\bin>abs -n 1000 -c 150 -s 86400 https://192.168.2.19:20001/pokijan.jpg
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.2.19 (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
SSL handshake failed (5).
SSL handshake failed (5).
SSL handshake failed (5).
[...]
Completed 600 requests
SSL handshake failed (5).
SSL handshake failed (5).
SSL handshake failed (5).
[...]
Completed 700 requests
SSL handshake failed (5).
SSL handshake failed (5).
SSL handshake failed (5).
[...]
Completed 800 requests
SSL handshake failed (5).
SSL handshake failed (5).
SSL handshake failed (5).
[...]
Completed 900 requests
SSL handshake failed (5).
SSL handshake failed (5).
SSL handshake failed (5).
[...]
Completed 1000 requests
SSL handshake failed (5).
Finished 1000 requests


Server Software:        myserver/1.0
Server Hostname:        192.168.2.19
Server Port:            20001
SSL/TLS Protocol:       TLSv1.2,ECDHE-RSA-AES256-GCM-SHA384,2048,256
Server Temp Key:        X25519 253 bits

Document Path:          /pokijan.jpg
Document Length:        15706 bytes

Concurrency Level:      150
Time taken for tests:   322.989 seconds
Complete requests:      1000
Failed requests:        276
   (Connect: 0, Receive: 0, Length: 276, Exceptions: 0)
Total transferred:      11488350 bytes
HTML transferred:       11386850 bytes
Requests per second:    3.10 [#/sec] (mean)
Time per request:       48448.421 [ms] (mean)
Time per request:       322.989 [ms] (mean, across all concurrent requests)
Transfer rate:          34.74 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0 3546 11025.3    187  119202
Processing:     4 35458 57444.9    463  174497
Waiting:        0  294 622.1     77   14406
Total:         19 39004 56342.0   2829  174497

Percentage of the requests served within a certain time (ms)
  50%   2829
  66%  16509
  75%  107971
  80%  115533
  90%  133179
  95%  133585
  98%  133672
  99%  174438
 100%  174497 (longest request)