ab-tests/pokijan.jpg/ab_multithreading_secure_c200.txt
C:\xampp\apache\bin>abs -n 1000 -c 200 -s 86400 https://192.168.2.19:20001/pokijan.jpg
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.2.19 (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
SSL handshake failed (5).
SSL handshake failed (5).
SSL handshake failed (5).
[...]
Completed 600 requests
SSL handshake failed (5).
SSL handshake failed (5).
SSL handshake failed (5).
[...]
Completed 700 requests
SSL handshake failed (5).
SSL handshake failed (5).
SSL handshake failed (5).
[...]
Completed 800 requests
SSL handshake failed (5).
SSL handshake failed (5).
SSL handshake failed (5).
[...]
Completed 900 requests
SSL handshake failed (5).
SSL handshake failed (5).
SSL handshake failed (5).
[...]
Completed 1000 requests
SSL handshake failed (5).
SSL handshake failed (5).
SSL handshake failed (5).
Finished 1000 requests


Server Software:        myserver/1.0
Server Hostname:        192.168.2.19
Server Port:            20001
SSL/TLS Protocol:       TLSv1.2,ECDHE-RSA-AES256-GCM-SHA384,2048,256
Server Temp Key:        X25519 253 bits

Document Path:          /pokijan.jpg
Document Length:        15706 bytes

Concurrency Level:      200
Time taken for tests:   265.678 seconds
Complete requests:      1000
Failed requests:        296
   (Connect: 0, Receive: 0, Length: 296, Exceptions: 0)
Total transferred:      11203122 bytes
HTML transferred:       11104142 bytes
Requests per second:    3.76 [#/sec] (mean)
Time per request:       53135.520 [ms] (mean)
Time per request:       265.678 [ms] (mean, across all concurrent requests)
Transfer rate:          41.18 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0 4482 12028.7    223  118933
Processing:     4 40151 64263.4    417  224426
Waiting:        0  236 387.7     62    4590
Total:         16 44633 62603.9   3736  224426

Percentage of the requests served within a certain time (ms)
  50%   3736
  66%  33100
  75%  106728
  80%  130766
  90%  133102
  95%  134300
  98%  219263
  99%  224373
 100%  224426 (longest request)