ab-tests/pokijan.jpg/ab_multithreading_secure_c200.txt
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.2.19 (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
SSL handshake failed (5).
SSL handshake failed (5).
Completed 600 requests
SSL handshake failed (5).
SSL handshake failed (5).
SSL handshake failed (5).
[...]
Completed 700 requests
SSL handshake failed (5).
SSL handshake failed (5).
SSL handshake failed (5).
[...]
Completed 800 requests
SSL handshake failed (5).
SSL handshake failed (5).
SSL handshake failed (5).
[...]
Completed 900 requests
SSL handshake failed (5).
SSL handshake failed (5).
SSL handshake failed (5).
[...]
Completed 1000 requests
Finished 1000 requests


Server Software:        myserver/1.0
Server Hostname:        192.168.2.19
Server Port:            20001
SSL/TLS Protocol:       TLSv1.2,ECDHE-RSA-AES256-GCM-SHA384,2048,256
Server Temp Key:        X25519 253 bits

Document Path:          /pokijan.jpg
Document Length:        15706 bytes

Concurrency Level:      200
Time taken for tests:   264.027 seconds
Complete requests:      1000
Failed requests:        202
   (Connect: 0, Receive: 0, Length: 202, Exceptions: 0)
Total transferred:      12645108 bytes
HTML transferred:       12533388 bytes
Requests per second:    3.79 [#/sec] (mean)
Time per request:       52805.328 [ms] (mean)
Time per request:       264.027 [ms] (mean, across all concurrent requests)
Transfer rate:          46.77 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0 7104 15931.2   1417  121285
Processing:     3 34101 68699.1   1248  217815
Waiting:        0  904 782.4    766    3486
Total:         27 41204 67152.5   5161  217815

Percentage of the requests served within a certain time (ms)
  50%   5161
  66%  16265
  75%  35358
  80%  112547
  90%  132964
  95%  217664
  98%  217797
  99%  217807
 100%  217815 (longest request)